cospec_benchmarks/A_20250619_140639/full_cospec_7_12_math500_output.txt
INFO 06-19 14:06:54 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, num_prompts=7200, logprobs=None, request_rate=12.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': False}
Running test requests 1 to 128 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 129 to 256 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 257 to 384 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 385 to 512 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': True}
Selective validator trained after 512 test requests (107.32 seconds)
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark will process 7200 prompts
============ Serving Benchmark Result ============
Successful requests:                     7200      
Benchmark duration (s):                  633.62    
Total input tokens:                      527904    
Total generated tokens:                  1557360   
Request throughput (req/s):              11.36     
Output token throughput (tok/s):         2457.86   
Total Token throughput (tok/s):          3291.01   
---------------Time to First Token----------------
Mean TTFT (ms):                          4665.04   
Median TTFT (ms):                        789.07    
P99 TTFT (ms):                           16451.42  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          70.92     
Median TPOT (ms):                        64.18     
P99 TPOT (ms):                           202.21    
---------------Inter-token Latency----------------
Mean ITL (ms):                           300.02    
Median ITL (ms):                         281.49    
P99 ITL (ms):                            744.95    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          17667.61  
Median E2EL (ms):                        15544.32  
P99 E2EL (ms):                           57028.69  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 108.79    
Median Token Latency (ms):               81.59     
P99 Token Latency (ms):                  447.67    
==================================================